src/game-scenario.yml
config:
  target: "{{ $env.TARGET }}"
  socketio: 
    query: 'game-id=117731'
  phases:
    - duration: 20 # 테스트 시간
      arrivalRate: 10 # 1초에 몇 명의 유저가 들어올 것인지 설정 (arrivalRate * duration = 총 유저 수)
  processor: "processors.js" 

scenarios:
  - name: "1-minute 200 players test"
    engine: socketio
    flow:
      - function: 'setPlayerName'
      - think: 1
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
  - name: "200 players test2"
    engine: socketio
    flow:
      - function: 'setPlayerName'
      - think: 1
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.5
  - name: "200 players test3"
    engine: socketio
    flow:
      - function: 'setPlayerName'
      - think: 1
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.9
      - function: 'chatMessage'
      - think: 0.1
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.1
      - function: 'chatMessage'
      - think: 0.9
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6
      - function: 'updatePosition'
      - think: 0.8
      - function: 'chatMessage'
      - think: 0.2
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.2
      - function: 'chatMessage'
      - think: 0.8
      - function: 'updatePosition'
      - think: 0.3
      - function: 'chatMessage'
      - think: 0.7
      - function: 'updatePosition'
      - think: 0.5
      - function: 'chatMessage'
      - think: 0.5
      - function: 'updatePosition'
      - think: 0.4
      - function: 'chatMessage'
      - think: 0.6